# リストから項目を読む
# 昼食メニューを決めるプログラム

# あらかじめ定義されたメニューリストあり
# ユーザーにインデックス番号を入力して、
# そのインデックスメニューを出力するプログラム
# ユーザーが無効なインデックスを入力した場合は、
# "無効な選択です"と出力
menus = ["피자","파스타","샐러드","스시","버거"]

# 사용자에게 인덱스를 입력받습니다.
index = int(input("메뉴의 인덱스를 선택하세요(0부터 시작): "))

# 여기에 선택된 인덱스의 메뉴를 추력하는 코드를 작성하세요.
while True :
    if index == 0 :
        print("선택된 메뉴:피자 ")
        break
    elif index == 1 :
        print("선택된 메뉴:파스타 ")
        break
    elif index == 2 :
        print("선택된 메뉴:샐러드 ")
        break
    elif index == 3 :
        print("선택된 메뉴:스시 ")
        break
    elif index == 4 :
        print("선택된 메뉴:버거 ")
        break
    else :
        print("유호하지 않은 선택입니다. ")
        break
    