# 気温に応じた活動推薦プログラムの作成
# 入力:ユーザーから現在の摂氏温度を入力
# 入力された気温に応じて適切なアクティビティを推奨するプログラムを作成
# 温度範囲による活動推薦の条件
# 水泳：３０度以上
# 登山：２０度以上
# 自転車に乗る：10度以上２０度未満
# スキー：１０度未満

# 입력
temperature = float(input("현재 온도(섭씨)를 입력하세요: "))

# 출력
print(' ')
print("현재 온도: ", round(temperature, 1),"도")

# if 30도 이상의 경우 : 수영
if temperature > 30 :
    print("추천 활동: 수영 ")

# if 20도 이상의 경우 : 등산
elif temperature > 20 :
    print("추천 활동: 등산 ")

# if 10도 이상의 경우 : 자전거 타기
elif temperature >= 10 :
    print("추천 활동: 자전거 타기 ")

# if 10도 미만의 경우 : 스키
else :
    print("추천 활동: 스키 ")

